MicrochipTech/dspic33a-high-speed-adc-example/adc_dma_40msps.c
    DMA0SEL = DMA_TRIG_ADC_CH0;             /* ADCn Done CH0            */
    DMA0SRC = (uint32_t)&ADCREG(CH0RES);    /* per-conversion result    */
    DMA0DST = (uint32_t)buf;                /* RAM destination          */
    DMA0CNT = SAMPLES_PER_BUF;              /* transactions per block   */
    DMA0STAT = 0u;                          /* clear any stale flags    */

    DMA0CH = 0u;
    DMA0CHbits.SIZE    = 1u;          /* 16-bit transfers               */
    DMA0CHbits.SAMODE  = 0u;          /* source address unchanged       */
    DMA0CHbits.DAMODE  = 1u;          /* destination incremented        */
    DMA0CHbits.TRMODE  = 3u;          /* repeated continuous            */
    DMA0CHbits.RELOADD = 1u;          /* reload destination each block  */
    DMA0CHbits.RELOADC = 1u;          /* reload count each block        */
    DMA0CHbits.HALFEN  = 1u;          /* interrupt at half              */
    DMA0CHbits.DONEEN  = 1u;          /* interrupt on block complete    */
    DMA0CHbits.RETEN   = 0u;          /* see note 1 at the counters     */

    /* Round robin arbitration. With one channel it makes no difference,
     * but it is the setting that matters once several ADC streams share
     * the single DMA data bus (DS70005591D 13.4.4, p825). */
    DMACONbits.PRIORITY = 1u;

    DMACONbits.ON   = 1;
    DMA0CHbits.CHEN = 1;
}

/* ------------------------------------------------------------------ *
 * DMA interrupt - one per buffer half
 *
 * HALF: the first half is complete, the DMA is filling the second.
 * DONE: the second half is complete, the DMA has reloaded to the start
 *       and the ADC burst has ended - apply a pending input change and,
 *       if the stream is enabled, start the next burst here.
 *
 * Priority 4 (IPC9 default). The console's UART receive interrupt runs
 * at priority 1, so this ISR preempts a running command.
 *
 * Deliberately short. Everything this counts is a hardware flag, so a
 * long ISR would itself become the reason for the next overrun.
 * ------------------------------------------------------------------ */
void __attribute__((interrupt, no_auto_psv)) _DMA0Interrupt(void)
{
    const uint32_t st = DMA0STAT;     /* one snapshot, then act on it   */

    if (st & _DMA0STAT_OVERRUN_MASK) {
        /* Triggered while the previous transfer was still in progress
         * (p816): the bus did not keep up. This is the measurement. */
        dma_overrun++;
        DMA0STATbits.OVERRUN = 0;
    }
    if (st & _DMA0STAT_ADRERR_MASK) {
        dma_addr_err++;
        DMA0STATbits.ADRERR = 0;
    }
    if (st & (_DMA0STAT_BRERR_MASK | _DMA0STAT_BWERR_MASK)) {
        dma_bus_err++;
        DMA0STATbits.BRERR = 0;
        DMA0STATbits.BWERR = 0;
    }

    /* Both halves pending at once means this ISR arrived more than one
     * half (25.6 us) late and the first half has already been
     * overwritten by the DMA reload. */
    if ((st & _DMA0STAT_HALF_MASK) && (st & _DMA0STAT_DONE_MASK)) {
        late_service++;
    }

    if (st & _DMA0STAT_HALF_MASK) {
        DMA0STATbits.HALF = 0;
        ready_half  = 0u;
        last_sample = buf[SAMPLES_PER_HALF - 1u];
        blocks_done++;
    }
    if (st & _DMA0STAT_DONE_MASK) {
        DMA0STATbits.DONE = 0;
        ready_half  = 1u;
        last_sample = buf[SAMPLES_PER_BUF - 1u];
        blocks_done++;

        /* The channel is idle between bursts: this is the only safe
         * moment to change its input or sample time. */
        if (switch_pending) {
            ADCREG(CH0CON1bits).PINSEL = pinsel_next;
            ADCREG(CH0CON1bits).SAMC   = samc_next;
            pinsel_cur = pinsel_next;
            samc_cur   = samc_next;
            switch_pending = false;
        }
        if (run_enabled) {
            adc_start_burst();        /* next SAMPLES_PER_BUF samples   */
        } else {
            burst_active = false;
        }
    }

    IFS2bits.DMA0IF = 0;
}

/* ------------------------------------------------------------------ *
 * Control API (adc_dma_40msps.h)
 * ------------------------------------------------------------------ */
void capture_start(void)
{
    run_enabled = true;
    if (!burst_active) {
        adc_start_burst();
    }
}

void capture_stop(void)
{
    run_enabled = false;
}

bool capture_running(void)
{
    return run_enabled;
}

bool capture_set_input(uint8_t pinsel, uint8_t samc)
{
    if ((pinsel > 15u) || (samc > 31u)) {
        return false;
    }
    pinsel_next = pinsel;
    samc_next   = samc;
    switch_pending = true;
    if (!burst_active) {
        /* Nothing running: apply right away, the channel is idle. */
        ADCREG(CH0CON1bits).PINSEL = pinsel;
        ADCREG(CH0CON1bits).SAMC   = samc;
        pinsel_cur = pinsel;
        samc_cur   = samc;
        switch_pending = false;
    }
    return true;
}

uint8_t capture_pinsel(void) { return pinsel_cur; }
uint8_t capture_samc(void)   { return samc_cur; }

const volatile uint16_t *capture_completed_half(void)
{
    return &buf[ready_half ? SAMPLES_PER_HALF : 0u];
}

void counters_clear(void)
{
    dma_overrun = 0; dma_addr_err = 0; dma_bus_err = 0;
    late_service = 0; proc_missed = 0;
}

void led_mode(uint8_t mode)
{
    led_auto = mode;
    if (mode == 0u)      { LED_OFF(); }
    else if (mode == 1u) { LED_ON();  }
}

uint8_t led_get_mode(void) { return led_auto; }

/* ------------------------------------------------------------------ *
 * Process one completed buffer half
 *
 * Placeholder for the customer's "+ and -" arithmetic. Written as a
 * plain accumulate so the cost of touching every sample is visible in
 * the measurement: at 40 MSPS this loop sees 40 million values per
 * second and per channel, and whether the CPU keeps up is as much a
 * question as the DMA bandwidth.
 * ------------------------------------------------------------------ */
static void process_buffer(const volatile uint16_t *b, uint32_t n)
{
    int32_t acc = 0;
    for (uint32_t i = 0; i < n; i++) {
        acc += (int32_t)b[i];
    }
    proc_result = acc;
}

static uint32_t half_mean(const volatile uint16_t *b, uint32_t n)
{
    uint32_t acc = 0;
    for (uint32_t i = 0; i < n; i++) {
        acc += b[i];
    }
    return acc / n;
}

bool capture_service(void)
{
    const uint32_t done = blocks_done;
    if (done == seen_blocks) {
        return false;
    }
    if ((done - seen_blocks) > 1u) {
        proc_missed += (done - seen_blocks) - 1u;
    }
    seen_blocks = done;
    process_buffer(capture_completed_half(), SAMPLES_PER_HALF);

