MicrochipTech/dspic33a-high-speed-adc-example/adc_dma_40msps.c
    /* Heartbeat: slow while clean, fast once any error counter moved. */
    if (led_auto == 2u) {
        const bool clean = (dma_overrun | dma_addr_err | dma_bus_err |
                            late_service | proc_missed) == 0u;
        if ((done % (clean ? HEARTBEAT_OK : HEARTBEAT_ERR)) == 0u) {
            LED_TOGGLE();
        }
    }
    return true;
}

/* Wait until blocks_done passes a value. Returns 0, or 6 (nothing
 * moves) or 8 (the DMA switched itself off, e.g. on an address fault). */
static uint32_t wait_for_blocks(uint32_t target)
{
    uint32_t n = WAIT_LIMIT;
    while (blocks_done < target) {
        if (DMA0CHbits.CHEN == 0u) { return 8u; }
        if (--n == 0u)             { return 6u; }
    }
    return 0u;
}

uint32_t capture_selftest(uint32_t *mean)
{
    const uint8_t  keep_pinsel = pinsel_cur;
    const uint8_t  keep_samc   = samc_cur;
    const bool     was_running = run_enabled;
    uint32_t       rc;

    (void)capture_set_input(SELFTEST_PINSEL, SELFTEST_SAMC);
    capture_start();

    /* The switch takes effect at the next DONE, then a full burst runs
     * on the new input: wait long enough that the half we judge is the
     * reference and nothing else. */
    rc = wait_for_blocks(blocks_done + SELFTEST_HALVES);
    if (rc == 0u) {
        const uint32_t m = half_mean(capture_completed_half(), SAMPLES_PER_HALF);
        selftest_mean = m;
        if (mean != NULL) { *mean = m; }
        if ((m < SELFTEST_MIN) || (m > SELFTEST_MAX)) { rc = 7u; }
    }

    (void)capture_set_input(keep_pinsel, keep_samc);
    if (rc == 0u) {
        rc = wait_for_blocks(blocks_done + SELFTEST_HALVES);   /* settle */
    }
    if (!was_running) {
        capture_stop();
    }
    return rc;
}

/* ------------------------------------------------------------------ */
int main(void)
{
    LED_OFF();
    LED_TRIS = 0u;

    clock_init();

    /* The console lives in the UART1 receive interrupt from here on. It
     * is started before the self-test so that a stop code is preceded
     * by the banner on the terminal. */
    cli_init();

    /* ---- Self-test on the internal 15/16 * VDD reference ----
     * Same clock, ADC, DMA and ISR as the real measurement, only the
     * input differs. If the mean is right, the whole chain works. */
    adc_init(ADC_PINSEL, ADC_SAMC);
    dma0_init();

    IFS2bits.DMA0IF = 0;              /* IEC2 bit 13, IPC9 default 4    */
    IEC2bits.DMA0IE = 1;

    {
        const uint32_t rc = capture_selftest(NULL);
        if (rc != 0u) { fail(rc); }
    }

    /* ---- Measurement ---- */
    capture_start();
    LED_ON();

    uint32_t idle = 0;
    for (;;) {
        if (capture_service()) {
            idle = 0;
        } else if (run_enabled) {
            /* The stream stopped: burst restart lost, or the DMA shut
             * itself off. Say so instead of sitting here silently. */
            if (DMA0CHbits.CHEN == 0u) { fail(8u); }
            if (++idle > WAIT_LIMIT)   { fail(6u); }
        } else {
            idle = 0;
        }

        /* What to look at with the debugger or "status":
         *   blocks_done   x SAMPLES_PER_HALF / elapsed time = actual rate
         *                 (includes the re-trigger gap once per buffer)
         *   dma_overrun   must stay 0, otherwise the DMA bus lost samples
         *   late_service  must stay 0, otherwise the ISR is too slow
         *   proc_missed   must stay 0, otherwise main() is too slow
         *   last_sample   changing means data is really moving
         *   selftest_mean ~3840 = the chain was proven before AN5 was used
         *   fail_code     0 while running; the LED pattern otherwise
         */
    }

    return 0;
}
